InformationRegisters/А_НастройкиПодключенияБаз.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>А_НастройкиПодключенияБаз</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сервер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПланОбмена</Name>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.ОбменУправлениеПредприятиемБухгалтерия20</v8:Type>
						<v8:Type>cfg:ExchangePlanRef.КазначействоBASERP</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПутьКОбработкеПланаОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/А_ПодключенияБазСервер/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Возвращает COM-соединение (V83.COMConnector) с внешней базой по идентификатору
// из регистра сведений А_НастройкиПодключенияБаз.
//
// Параметры:
//  ИдентификаторБазы - Строка - ключ записи регистра, например "zup_1", "BuhBud".
//
// Возвращаемое значение:
//  COMОбъект - внешнее соединение с базой.
//
Функция УстановитьСоединение(Знач ИдентификаторБазы) Экспорт

	Настройки = НастройкиБазы(ИдентификаторБазы);

	Параметры = ОбщегоНазначенияКлиентСервер.СтруктураПараметровДляУстановкиВнешнегоСоединения();
	Параметры.ВариантРаботыИнформационнойБазы = 1; // клиент-серверный
	Параметры.ИмяСервера1СПредприятия = Настройки.Сервер;
	Параметры.ИмяИнформационнойБазыНаСервере1СПредприятия = Настройки.ИмяБазы;
	Параметры.ИмяПользователя = Настройки.Пользователь;
	Параметры.ПарольПользователя = Настройки.Пароль;

	Результат = ОбщегоНазначения.УстановитьВнешнееСоединениеСБазой(Параметры);

	Если Результат.Соединение = Неопределено Тогда
		// Пароль в текст ошибки не включать
		ВызватьИсключение СтрШаблон(
			НСтр("ru='Не удалось подключиться к базе ""%1"" (Srvr=%2; Ref=%3): %4';uk='Не вдалося підключитися до бази ""%1"" (Srvr=%2; Ref=%3): %4'"),
			ИдентификаторБазы, Настройки.Сервер, Настройки.ИмяБазы, Результат.ПодробноеОписаниеОшибки);
	КонецЕсли;

	Возврат Результат.Соединение;

КонецФункции

// Возвращает строку подключения к внешней базе по идентификатору из регистра
// сведений А_НастройкиПодключенияБаз (для кода, которому нужна строка как есть).
//
// Параметры:
//  ИдентификаторБазы - Строка - ключ записи регистра.
//
// Возвращаемое значение:
//  Строка - вида: Srvr="localhost";Ref="BuhBud";Usr="cfo";Pwd="...";
//
Функция СтрокаПодключения(Знач ИдентификаторБазы) Экспорт

	Настройки = НастройкиБазы(ИдентификаторБазы);

	Возврат СтрШаблон("Srvr=""%1"";Ref=""%2"";Usr=""%3"";Pwd=""%4"";",
		СтрЗаменить(Настройки.Сервер, """", """"""),
		СтрЗаменить(Настройки.ИмяБазы, """", """"""),
		СтрЗаменить(Настройки.Пользователь, """", """"""),
		СтрЗаменить(Настройки.Пароль, """", """"""));

КонецФункции

// Заполняет регистр А_НастройкиПодключенияБаз записями по умолчанию (Сервер = localhost).
// Существующие записи не перезаписывает.
//
Процедура ЗаполнитьНастройкиПоУмолчанию() Экспорт

	Дефолты = Новый Массив;
	Дефолты.Добавить(Новый Структура("Идентификатор, ИмяБазы, Пользователь, Пароль, Комментарий",
		"zup_1",        "zup_1",   "cfo",     "2442", "ЗУП регламентная (бухгалтерская зарплата)"));
	Дефолты.Добавить(Новый Структура("Идентификатор, ИмяБазы, Пользователь, Пароль, Комментарий",
		"zup_2",        "zup_2",   "cfo",     "2442", "ЗУП управленческая"));
	Дефолты.Добавить(Новый Структура("Идентификатор, ИмяБазы, Пользователь, Пароль, Комментарий",
		"BuhBud",       "BuhBud",  "cfo",     "2442", "BAS Бухгалтерія"));
	Дефолты.Добавить(Новый Структура("Идентификатор, ИмяБазы, Пользователь, Пароль, Комментарий",
		"BuhKazn",      "BuhKazn", "cfo",     "2442", "Казна"));

	Для Каждого Дефолт Из Дефолты Цикл

		Запись = РегистрыСведений.А_НастройкиПодключенияБаз.СоздатьМенеджерЗаписи();
		Запись.ИдентификаторБазы = Дефолт.Идентификатор;
		Запись.Прочитать();
		Если Запись.Выбран() Тогда
			Продолжить; // не перетираем существующую
		КонецЕсли;

		Запись = РегистрыСведений.А_НастройкиПодключенияБаз.СоздатьМенеджерЗаписи();
		Запись.ИдентификаторБазы = Дефолт.Идентификатор;
		Запись.Сервер = "localhost";
		Запись.ИмяБазы = Дефолт.ИмяБазы;
		Запись.Пользователь = Дефолт.Пользователь;
		Запись.Пароль = Дефолт.Пароль;
		Запись.Комментарий = Дефолт.Комментарий;
		Запись.Записать(Ложь);

	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Читает запись регистра А_НастройкиПодключенияБаз по идентификатору;
// при отсутствии записи вызывает исключение с подсказкой пользователю.
//
// Регистр не входит в роли, поэтому чтение выполняется в привилегированном режиме:
// флаг "Привилегированный" у модуля поставить нельзя — платформа считает его
// несовместимым с флагом "Внешнее соединение", который нужен для вызовов по COM.
//
Функция НастройкиБазы(Знач ИдентификаторБазы)

	УстановитьПривилегированныйРежим(Истина);

	Запись = РегистрыСведений.А_НастройкиПодключенияБаз.СоздатьМенеджерЗаписи();
	Запись.ИдентификаторБазы = СокрЛП(ИдентификаторБазы);
	Запись.Прочитать();

	Если НЕ Запись.Выбран() Тогда
		ВызватьИсключение СтрШаблон(
			НСтр("ru='Не заполнены настройки подключения к базе ""%1"". Заполните регистр сведений ""Настройки подключения баз (А)"" (Все функции - Регистры сведений).';uk='Не заповнені налаштування підключення до бази ""%1"". Заповніть регістр відомостей ""Налаштування підключення баз (А)"" (Всі функції - Регістри відомостей).'"),
			ИдентификаторБазы);
	КонецЕсли;

	Возврат Новый Структура("Сервер, ИмяБазы, Пользователь, Пароль",
		Запись.Сервер, Запись.ИмяБазы, Запись.Пользователь, Запись.Пароль);

КонецФункции

#КонецОбласти
